zephyrproject-rtos/hal_nxp/dts/nxp/mcx/mcxa/pinctrl/MCXA287VASR-pinctrl.h
/*
 * NOTE: Autogenerated file by gen_soc_headers.py
 * for MCXA287VASR/signal_configuration.xml
 *
 * 
 */

/*
 * Delta-deduplicated by dedup_pinctrl.py:
 * based on MCXA344VLH-pinctrl.h with this part's differences applied
 * below (94 removed, 0 changed,
 * 294 added). Regenerate with dedup_pinctrl.py;
 * do not edit by hand.
 * target-hash: 796e143b40c94355
 */

#ifndef _ZEPHYR_DTS_BINDING_MCXA287VASR_WRAPPER_
#define _ZEPHYR_DTS_BINDING_MCXA287VASR_WRAPPER_

#include "MCXA344VLH-pinctrl.h"

/* Signals not present on this part */
#undef ADC1_A20_P3_31
#undef ADC1_A21_P3_30
#undef ADC1_A22_P3_29
#undef ADC1_A2_P2_19
#undef CAN0_RXD_P1_12
#undef CAN0_RXD_P1_7
#undef CAN0_TXD_P1_13
#undef CAN0_TXD_P1_6
#undef CLKOUT_P0_6
#undef CLKOUT_P3_8
#undef CMP0_IN0_P2_2
#undef CMP0_IN3_P1_0
#undef CMP1_IN0_P2_3
#undef CMP1_IN1_P0_3
#undef CMP1_IN2_P1_5
#undef CMP1_IN3_P1_1
#undef CMP1_INN4_P2_2
#undef CMP1_INP4_P2_19
#undef CMP1_OUT_P0_6
#undef CMP2_IN0_P2_4
#undef CMP2_IN3_P1_2
#undef CMP2_INN4_P2_2
#undef CMP2_INP4_P2_6
#undef CT0_MAT2_P3_30
#undef CT0_MAT3_P3_31
#undef CT_INP12_P3_28
#undef CT_INP13_P3_27
#undef CT_INP3_P3_29
#undef FREQME_CLK_OUT0_P3_1
#undef FREQME_CLK_OUT1_P3_6
#undef ISPMODE_N_P3_29
#undef LPI2C0_SCLS_P1_11
#undef LPI2C0_SCL_P1_9
#undef LPI2C0_SDAS_P1_10
#undef LPI2C0_SDA_P1_8
#undef LPI2C1_HREQ_P3_29
#undef LPI2C1_SCLS_P3_30
#undef LPI2C1_SCL_P3_27
#undef LPI2C1_SDAS_P3_31
#undef LPI2C1_SDA_P3_28
#undef LPTMR0_ALT2_P3_31
#undef OPAMP0_INN_P2_13
#undef OPAMP0_INP_P2_12
#undef OPAMP0_OUT_P2_15
#undef OPAMP1_INN_P2_17
#undef OPAMP1_INP_P2_16
#undef OPAMP1_OUT_P2_19
#undef OPAMP2_INN_P2_1
#undef OPAMP2_INP_P2_0
#undef OPAMP2_OUT_P2_6
#undef P2_19
#undef P3_27
#undef P3_28
#undef P3_29
#undef P3_30
#undef P3_31
#undef PWM0_A0_P3_0
#undef PWM0_A1_P3_8
#undef PWM0_A2_P3_10
#undef PWM0_A3_P3_6
#undef PWM0_B0_P3_1
#undef PWM0_B1_P3_9
#undef PWM0_B2_P3_11
#undef PWM0_B3_P3_7
#undef PWM0_X0_P3_12
#undef PWM0_X1_P3_13
#undef PWM0_X2_P3_14
#undef PWM0_X3_P3_15
#undef PWM1_A0_P3_30
#undef PWM1_A0_P3_6
#undef PWM1_A1_P3_14
#undef PWM1_A2_P3_12
#undef PWM1_A3_P3_27
#undef PWM1_B0_P3_31
#undef PWM1_B0_P3_7
#undef PWM1_B1_P3_15
#undef PWM1_B2_P3_13
#undef PWM1_B3_P3_28
#undef PWM1_X0_P3_0
#undef PWM1_X1_P3_1
#undef SMARTDMA_PIO21_P2_19
#undef SMARTDMA_PIO27_P3_27
#undef SMARTDMA_PIO28_P3_28
#undef SMARTDMA_PIO29_P3_29
#undef SMARTDMA_PIO30_P3_30
#undef SMARTDMA_PIO31_P3_31
#undef TRIG_IN10_P3_31
#undef TRIG_IN11_P3_28
#undef TRIG_OUT5_P2_19
#undef TRIG_OUT6_P3_30
#undef TRIG_OUT7_P3_27
#undef WUU0_IN26_P3_28
#undef WUU0_IN27_P3_29
#undef WUU0_IN30_P3_27

/* Signals specific to this part */
#define ADC0_A12_P0_22 A15X_MUX('0',22,0)
#define ADC0_A13_P0_23 A15X_MUX('0',23,0)
#define ADC0_A8_P0_18 A15X_MUX('0',18,0)
#define ADC0_A9_P0_19 A15X_MUX('0',19,0)
#define ADC1_A20_P5_0 A15X_MUX('5',0,0)
#define ADC1_A21_P5_1 A15X_MUX('5',1,0)
#define ADC1_A22_P5_2 A15X_MUX('5',2,0)
#define CAN1_RXD_P1_0 A15X_MUX('1',0,11)
#define CAN1_RXD_P1_12 A15X_MUX('1',12,11)
#define CAN1_RXD_P1_7 A15X_MUX('1',7,11)
#define CAN1_RXD_P2_0 A15X_MUX('2',0,11)
#define CAN1_RXD_P2_15 A15X_MUX('2',15,11)
#define CAN1_TXD_P1_1 A15X_MUX('1',1,11)
#define CAN1_TXD_P1_13 A15X_MUX('1',13,11)
#define CAN1_TXD_P1_6 A15X_MUX('1',6,11)
#define CAN1_TXD_P2_1 A15X_MUX('2',1,11)
#define CAN1_TXD_P2_16 A15X_MUX('2',16,11)
#define CLKOUT_P4_2 A15X_MUX('4',2,1)
#define CMP0_IN0_P1_0 A15X_MUX('1',0,0)
#define CMP0_IN3_P1_5 A15X_MUX('1',5,0)
#define CMP0_INN4_P2_2 A15X_MUX('2',2,0)
#define CMP0_INN5_P2_3 A15X_MUX('2',3,0)
#define CMP0_OUT_P0_18 A15X_MUX('0',18,8)
#define CT0_MAT0_P0_22 A15X_MUX('0',22,5)
#define CT0_MAT1_P0_23 A15X_MUX('0',23,5)
#define CT0_MAT2_P0_18 A15X_MUX('0',18,4)
#define CT0_MAT3_P0_19 A15X_MUX('0',19,4)
#define CT3_MAT0_P2_16 A15X_MUX('2',16,4)
#define CT3_MAT1_P2_17 A15X_MUX('2',17,4)
#define CT4_MAT0_P1_6 A15X_MUX('1',6,5)
#define CT4_MAT0_P2_12 A15X_MUX('2',12,4)
#define CT4_MAT0_P4_2 A15X_MUX('4',2,4)
#define CT4_MAT1_P1_7 A15X_MUX('1',7,5)
#define CT4_MAT1_P2_13 A15X_MUX('2',13,4)
#define CT4_MAT1_P4_3 A15X_MUX('4',3,4)
#define CT4_MAT2_P3_6 A15X_MUX('3',6,4)
#define CT4_MAT2_P4_4 A15X_MUX('4',4,4)
#define CT4_MAT3_P2_15 A15X_MUX('2',15,4)
#define CT4_MAT3_P3_7 A15X_MUX('3',7,4)
#define CT4_MAT3_P4_5 A15X_MUX('4',5,4)
#define CT_INP0_P0_20 A15X_MUX('0',20,4)
#define CT_INP1_P0_21 A15X_MUX('0',21,4)
#define CT_INP2_P0_22 A15X_MUX('0',22,4)
#define CT_INP3_P0_23 A15X_MUX('0',23,4)
#define CT_INP6_P4_6 A15X_MUX('4',6,4)
#define CT_INP7_P4_7 A15X_MUX('4',7,4)
#define DAC0_OUT_P2_2 A15X_MUX('2',2,0)
#define DAC1_OUT_P2_3 A15X_MUX('2',3,0)
#define ENET0_MDC_P1_2 A15X_MUX('1',2,9)
#define ENET0_MDIO_P1_3 A15X_MUX('1',3,9)
#define ENET0_RXD0_P1_11 A15X_MUX('1',11,9)
#define ENET0_RXD1_P1_12 A15X_MUX('1',12,9)
#define ENET0_RXDV_P1_13 A15X_MUX('1',13,9)
#define ENET0_TXD0_P1_6 A15X_MUX('1',6,9)
#define ENET0_TXD1_P1_7 A15X_MUX('1',7,9)
#define ENET0_TXD2_P1_8 A15X_MUX('1',8,9)
#define ENET0_TXD3_P1_9 A15X_MUX('1',9,9)
#define ENET0_TXEN_P1_5 A15X_MUX('1',5,9)
#define ENET0_TX_CLK_P1_4 A15X_MUX('1',4,9)
#define EWM0_IN_P0_16 A15X_MUX('0',16,1)
#define EWM0_IN_P0_18 A15X_MUX('0',18,1)
#define EWM0_IN_P0_22 A15X_MUX('0',22,1)
#define EWM0_OUT_B_P0_17 A15X_MUX('0',17,1)
#define EWM0_OUT_B_P0_19 A15X_MUX('0',19,1)
#define EWM0_OUT_B_P0_23 A15X_MUX('0',23,1)
#define EXTAL32K_P5_0 A15X_MUX('5',0,0)
#define FLEXIO0_D0_P0_0 A15X_MUX('0',0,6)
#define FLEXIO0_D0_P0_16 A15X_MUX('0',16,6)
#define FLEXIO0_D10_P1_2 A15X_MUX('1',2,6)
#define FLEXIO0_D10_P2_2 A15X_MUX('2',2,6)
#define FLEXIO0_D10_P4_2 A15X_MUX('4',2,6)
#define FLEXIO0_D11_P1_3 A15X_MUX('1',3,6)
#define FLEXIO0_D11_P2_3 A15X_MUX('2',3,6)
#define FLEXIO0_D11_P4_3 A15X_MUX('4',3,6)
#define FLEXIO0_D12_P1_4 A15X_MUX('1',4,6)
#define FLEXIO0_D12_P2_4 A15X_MUX('2',4,6)
#define FLEXIO0_D12_P4_4 A15X_MUX('4',4,6)
#define FLEXIO0_D13_P1_5 A15X_MUX('1',5,6)
#define FLEXIO0_D13_P2_5 A15X_MUX('2',5,6)
#define FLEXIO0_D13_P4_5 A15X_MUX('4',5,6)
#define FLEXIO0_D14_P1_6 A15X_MUX('1',6,6)
#define FLEXIO0_D14_P2_6 A15X_MUX('2',6,6)
#define FLEXIO0_D14_P3_6 A15X_MUX('3',6,6)
#define FLEXIO0_D14_P4_6 A15X_MUX('4',6,6)
#define FLEXIO0_D15_P1_7 A15X_MUX('1',7,6)
#define FLEXIO0_D15_P2_7 A15X_MUX('2',7,6)
#define FLEXIO0_D15_P3_7 A15X_MUX('3',7,6)
#define FLEXIO0_D15_P4_7 A15X_MUX('4',7,6)
#define FLEXIO0_D16_P1_8 A15X_MUX('1',8,6)
#define FLEXIO0_D16_P3_8 A15X_MUX('3',8,6)
#define FLEXIO0_D17_P1_9 A15X_MUX('1',9,6)
#define FLEXIO0_D17_P3_9 A15X_MUX('3',9,6)
#define FLEXIO0_D18_P1_10 A15X_MUX('1',10,6)
#define FLEXIO0_D18_P3_10 A15X_MUX('3',10,6)
#define FLEXIO0_D19_P1_11 A15X_MUX('1',11,6)
#define FLEXIO0_D19_P3_11 A15X_MUX('3',11,6)
#define FLEXIO0_D1_P0_1 A15X_MUX('0',1,6)
#define FLEXIO0_D1_P0_17 A15X_MUX('0',17,6)
#define FLEXIO0_D20_P1_12 A15X_MUX('1',12,6)
#define FLEXIO0_D20_P2_12 A15X_MUX('2',12,6)
#define FLEXIO0_D20_P3_12 A15X_MUX('3',12,6)
#define FLEXIO0_D21_P1_13 A15X_MUX('1',13,6)
#define FLEXIO0_D21_P2_13 A15X_MUX('2',13,6)
#define FLEXIO0_D21_P3_13 A15X_MUX('3',13,6)
#define FLEXIO0_D22_P3_14 A15X_MUX('3',14,6)
#define FLEXIO0_D23_P2_15 A15X_MUX('2',15,6)
#define FLEXIO0_D23_P3_15 A15X_MUX('3',15,6)
#define FLEXIO0_D24_P2_16 A15X_MUX('2',16,6)
#define FLEXIO0_D25_P2_17 A15X_MUX('2',17,6)
#define FLEXIO0_D2_P0_18 A15X_MUX('0',18,6)
#define FLEXIO0_D2_P0_2 A15X_MUX('0',2,6)
#define FLEXIO0_D30_P1_30 A15X_MUX('1',30,6)
#define FLEXIO0_D31_P1_31 A15X_MUX('1',31,6)
#define FLEXIO0_D3_P0_19 A15X_MUX('0',19,6)
#define FLEXIO0_D3_P0_3 A15X_MUX('0',3,6)
#define FLEXIO0_D4_P0_20 A15X_MUX('0',20,6)
#define FLEXIO0_D5_P0_21 A15X_MUX('0',21,6)
#define FLEXIO0_D6_P0_22 A15X_MUX('0',22,6)
#define FLEXIO0_D6_P0_6 A15X_MUX('0',6,6)
#define FLEXIO0_D7_P0_23 A15X_MUX('0',23,6)
#define FLEXIO0_D8_P1_0 A15X_MUX('1',0,6)
#define FLEXIO0_D8_P2_0 A15X_MUX('2',0,6)
#define FLEXIO0_D8_P3_0 A15X_MUX('3',0,6)
#define FLEXIO0_D9_P1_1 A15X_MUX('1',1,6)
#define FLEXIO0_D9_P2_1 A15X_MUX('2',1,6)
#define FLEXIO0_D9_P3_1 A15X_MUX('3',1,6)
#define FLEXSPI0_A_DATA0_P3_8 A15X_MUX('3',8,9)
#define FLEXSPI0_A_DATA1_P3_9 A15X_MUX('3',9,9)
#define FLEXSPI0_A_DATA2_P3_10 A15X_MUX('3',10,9)
#define FLEXSPI0_A_DATA3_P3_11 A15X_MUX('3',11,9)
#define FLEXSPI0_A_DQS_P3_6 A15X_MUX('3',6,9)
#define FLEXSPI0_A_SCLK_P3_7 A15X_MUX('3',7,9)
#define FLEXSPI0_A_SS0_B_P3_0 A15X_MUX('3',0,9)
#define FLEXSPI0_A_SS1_B_P3_1 A15X_MUX('3',1,9)
#define FLEXSPI0_B_DATA0_P3_15 A15X_MUX('3',15,9)
#define FLEXSPI0_B_DATA1_P3_14 A15X_MUX('3',14,9)
#define FLEXSPI0_B_DATA2_P3_13 A15X_MUX('3',13,9)
#define FLEXSPI0_B_DATA3_P3_12 A15X_MUX('3',12,9)
#define FLEXSPI0_B_DQS_P3_1 A15X_MUX('3',1,8)
#define FLEXSPI0_B_SS1_B_P3_6 A15X_MUX('3',6,8)
#define I3C0_PUR_P0_2 A15X_MUX('0',2,10)
#define I3C0_PUR_P0_22 A15X_MUX('0',22,10)
#define I3C0_SCL_P0_17 A15X_MUX('0',17,10)
#define I3C0_SCL_P0_21 A15X_MUX('0',21,10)
#define I3C0_SDA_P0_16 A15X_MUX('0',16,10)
#define I3C0_SDA_P0_20 A15X_MUX('0',20,10)
#define I3C1_SCL_P1_9 A15X_MUX('1',9,10)
#define I3C1_SDA1_P1_7 A15X_MUX('1',7,10)
#define I3C1_SDA2_P1_6 A15X_MUX('1',6,10)
#define I3C1_SDA3_P1_5 A15X_MUX('1',5,10)
#define I3C1_SDA_P1_8 A15X_MUX('1',8,10)
#define I3C2_SCL_P1_31 A15X_MUX('1',31,10)
#define I3C2_SCL_P4_3 A15X_MUX('4',3,10)
#define I3C2_SDA_P1_30 A15X_MUX('1',30,10)
#define I3C2_SDA_P4_4 A15X_MUX('4',4,10)
#define I3C3_SCL_P4_5 A15X_MUX('4',5,10)
#define I3C3_SCL_P4_6 A15X_MUX('4',6,10)
#define I3C3_SDA_P4_2 A15X_MUX('4',2,10)
#define I3C3_SDA_P4_7 A15X_MUX('4',7,10)
#define LPI2C0_SCLS_P0_18 A15X_MUX('0',18,2)
#define LPI2C0_SCLS_P0_22 A15X_MUX('0',22,2)
#define LPI2C0_SCL_P0_21 A15X_MUX('0',21,2)
#define LPI2C0_SDAS_P0_19 A15X_MUX('0',19,2)
#define LPI2C0_SDAS_P0_23 A15X_MUX('0',23,2)
#define LPI2C0_SDA_P0_20 A15X_MUX('0',20,2)
#define LPI2C2_HREQ_P4_6 A15X_MUX('4',6,2)
#define LPI2C2_SCLS_P1_11 A15X_MUX('1',11,3)
#define LPI2C2_SCLS_P4_5 A15X_MUX('4',5,2)
#define LPI2C2_SCL_P1_9 A15X_MUX('1',9,3)
#define LPI2C2_SCL_P4_3 A15X_MUX('4',3,2)
#define LPI2C2_SDAS_P1_10 A15X_MUX('1',10,3)
#define LPI2C2_SDAS_P4_2 A15X_MUX('4',2,2)
#define LPI2C2_SDA_P1_8 A15X_MUX('1',8,3)
#define LPI2C2_SDA_P4_4 A15X_MUX('4',4,2)
#define LPI2C3_HREQ_P4_7 A15X_MUX('4',7,2)
#define LPI2C3_SCL_P3_1 A15X_MUX('3',1,2)
#define LPI2C3_SDA_P3_0 A15X_MUX('3',0,2)
#define LPI2C4_SCLS_P1_5 A15X_MUX('1',5,8)
#define LPI2C4_SCL_P1_6 A15X_MUX('1',6,8)
#define LPI2C4_SDAS_P1_4 A15X_MUX('1',4,8)
#define LPI2C4_SDA_P1_7 A15X_MUX('1',7,8)
#define LPSPI2_PCS0_P2_3 A15X_MUX('2',3,8)
#define LPSPI2_PCS0_P4_2 A15X_MUX('4',2,8)
#define LPSPI2_PCS1_P2_6 A15X_MUX('2',6,8)
#define LPSPI2_PCS2_P2_5 A15X_MUX('2',5,8)
#define LPSPI2_PCS2_P4_6 A15X_MUX('4',6,8)
#define LPSPI2_PCS3_P2_4 A15X_MUX('2',4,8)
#define LPSPI2_PCS3_P4_7 A15X_MUX('4',7,8)
#define LPSPI2_SCK_P2_1 A15X_MUX('2',1,8)
#define LPSPI2_SCK_P4_3 A15X_MUX('4',3,8)
#define LPSPI2_SDI_P2_2 A15X_MUX('2',2,8)
#define LPSPI2_SDI_P4_5 A15X_MUX('4',5,8)
#define LPSPI2_SDO_P2_0 A15X_MUX('2',0,8)
#define LPSPI2_SDO_P4_4 A15X_MUX('4',4,8)
#define LPSPI3_PCS0_P3_0 A15X_MUX('3',0,7)
#define LPSPI3_PCS1_P3_1 A15X_MUX('3',1,7)
#define LPSPI3_PCS1_P3_6 A15X_MUX('3',6,7)
#define LPSPI3_PCS2_P3_10 A15X_MUX('3',10,7)
#define LPSPI3_PCS2_P3_13 A15X_MUX('3',13,7)
#define LPSPI3_PCS3_P3_11 A15X_MUX('3',11,7)
#define LPSPI3_PCS3_P3_12 A15X_MUX('3',12,7)
#define LPSPI3_SCK_P3_7 A15X_MUX('3',7,7)
#define LPSPI3_SDI_P3_14 A15X_MUX('3',14,7)
#define LPSPI3_SDI_P3_9 A15X_MUX('3',9,7)
#define LPSPI3_SDO_P3_15 A15X_MUX('3',15,7)
#define LPSPI3_SDO_P3_8 A15X_MUX('3',8,7)
#define LPSPI4_PCS0_P0_23 A15X_MUX('0',23,8)
#define LPSPI4_SCK_P0_21 A15X_MUX('0',21,8)
#define LPSPI4_SDI_P0_22 A15X_MUX('0',22,8)
#define LPSPI4_SDO_P0_20 A15X_MUX('0',20,8)
#define LPSPI5_SCK_P1_13 A15X_MUX('1',13,5)
#define LPSPI5_SDO_P1_12 A15X_MUX('1',12,5)
#define LPTMR0_ALT2_P5_0 A15X_MUX('5',0,2)
#define LPUART0_CTS_B_P0_23 A15X_MUX('0',23,3)
#define LPUART0_RTS_B_P0_22 A15X_MUX('0',22,3)
#define LPUART0_RXD_P0_20 A15X_MUX('0',20,3)
#define LPUART0_TXD_P0_21 A15X_MUX('0',21,3)
#define LPUART3_CTS_B_P4_6 A15X_MUX('4',6,3)
#define LPUART3_RTS_B_P4_7 A15X_MUX('4',7,3)
#define LPUART3_RXD_P4_2 A15X_MUX('4',2,3)
#define LPUART3_TXD_P4_5 A15X_MUX('4',5,3)
#define LPUART4_CTS_B_P2_0 A15X_MUX('2',0,3)
#define LPUART4_RTS_B_P2_1 A15X_MUX('2',1,3)
#define LPUART4_RXD_P2_6 A15X_MUX('2',6,3)
#define LPUART4_RXD_P4_4 A15X_MUX('4',4,3)
#define LPUART4_TXD_P2_7 A15X_MUX('2',7,3)
#define LPUART4_TXD_P4_3 A15X_MUX('4',3,3)
#define LPUART5_CTS_B_P1_12 A15X_MUX('1',12,8)
#define LPUART5_CTS_B_P3_8 A15X_MUX('3',8,8)
#define LPUART5_RTS_B_P1_13 A15X_MUX('1',13,8)
#define LPUART5_RTS_B_P3_9 A15X_MUX('3',9,8)
#define LPUART5_RXD_P1_11 A15X_MUX('1',11,8)
#define LPUART5_RXD_P3_11 A15X_MUX('3',11,8)
#define LPUART5_TXD_P1_10 A15X_MUX('1',10,8)
#define LPUART5_TXD_P3_10 A15X_MUX('3',10,8)
#define P0_18 A15X_MUX('0',18,0)
#define P0_19 A15X_MUX('0',19,0)
#define P0_20 A15X_MUX('0',20,0)
#define P0_21 A15X_MUX('0',21,0)
#define P0_22 A15X_MUX('0',22,0)
#define P0_23 A15X_MUX('0',23,0)
#define P4_2 A15X_MUX('4',2,0)
#define P4_3 A15X_MUX('4',3,0)
#define P4_4 A15X_MUX('4',4,0)
#define P4_5 A15X_MUX('4',5,0)
#define P4_6 A15X_MUX('4',6,0)
#define P4_7 A15X_MUX('4',7,0)
#define P5_0 A15X_MUX('5',0,0)
#define P5_1 A15X_MUX('5',1,0)
#define P5_2 A15X_MUX('5',2,0)
#define P5_3 A15X_MUX('5',3,0)
#define RTC_CLKOUT_P5_3 A15X_MUX('5',3,2)
#define SMARTDMA_PIO10_P0_20 A15X_MUX('0',20,7)
#define SMARTDMA_PIO11_P0_21 A15X_MUX('0',21,7)
#define SMARTDMA_PIO12_P0_22 A15X_MUX('0',22,7)
#define SMARTDMA_PIO13_P0_23 A15X_MUX('0',23,7)
#define SMARTDMA_PIO22_P4_2 A15X_MUX('4',2,7)
#define SMARTDMA_PIO23_P4_3 A15X_MUX('4',3,7)
#define SMARTDMA_PIO24_P4_4 A15X_MUX('4',4,7)
#define SMARTDMA_PIO25_P4_5 A15X_MUX('4',5,7)
#define SMARTDMA_PIO26_P4_6 A15X_MUX('4',6,7)
#define SMARTDMA_PIO27_P4_7 A15X_MUX('4',7,7)
#define SMARTDMA_PIO8_P0_18 A15X_MUX('0',18,7)
#define SMARTDMA_PIO9_P0_19 A15X_MUX('0',19,7)
#define SPC_LPREQ_P5_2 A15X_MUX('5',2,2)
#define TAMPER0_P5_2 A15X_MUX('5',2,3)
#define TAMPER1_P5_3 A15X_MUX('5',3,3)
#define TRIG_IN0/CT_INP16_P3_0_P3_0 A15X_MUX('3',0,4)
#define TRIG_IN1/CT_INP17_P3_1_P3_1 A15X_MUX('3',1,4)
#define TRIG_IN10_P5_0 A15X_MUX('5',0,1)
#define TRIG_IN11_P5_3 A15X_MUX('5',3,1)
#define TRIG_IN2/CT_INP6_P1_6_P1_6 A15X_MUX('1',6,4)
#define TRIG_IN3/CT_INP4_P3_8_P3_8 A15X_MUX('3',8,4)
#define TRIG_IN4/CT_INP6_P4_6_P4_6 A15X_MUX('4',6,4)
#define TRIG_IN4_P4_6 A15X_MUX('4',6,1)
#define TRIG_IN5/CT_INP7_P4_7_P4_7 A15X_MUX('4',7,4)
#define TRIG_IN5_P4_7 A15X_MUX('4',7,1)
#define TRIG_IN6/CT_INP12_P2_2_P2_2 A15X_MUX('2',2,4)
#define TRIG_IN7/CT_INP13_P2_3_P2_3 A15X_MUX('2',3,4)
#define TRIG_OUT3_P4_5 A15X_MUX('4',5,1)
#define TRIG_OUT6_P5_1 A15X_MUX('5',1,1)
#define USB1_OTGN_ID_P2_13 A15X_MUX('2',13,8)
#define USB1_OTGN_OC_P2_17 A15X_MUX('2',17,8)
#define USB1_OTGN_PWR_P2_16 A15X_MUX('2',16,8)
#define USB1_VBUSVALID_EXT_P2_12 A15X_MUX('2',12,1)
#define USB1_VBUSVALID_EXT_P2_15 A15X_MUX('2',15,8)
#define VBAT_WAKEUP_B_P5_2 A15X_MUX('5',2,1)
#define VREFO_P2_7 A15X_MUX('2',7,0)
#define WUU0_IN16_P4_2 A15X_MUX('4',2,0)
#define WUU0_IN17_P4_4 A15X_MUX('4',4,0)
#define WUU0_IN3_P0_19 A15X_MUX('0',19,0)
#define WUU0_IN4_P0_20 A15X_MUX('0',20,0)
#define WUU0_IN5_P0_23 A15X_MUX('0',23,0)
#define XTAL32K_P5_1 A15X_MUX('5',1,0)

#endif /* _ZEPHYR_DTS_BINDING_MCXA287VASR_WRAPPER_ */
